# DuctPipeSizeMismatch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PipingFailures..::..DuctPipeSizeMismatch Property
BuiltInFailures..::..PipingFailures Class See Also
---
The duct/pipe size is invalid for the service definition
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DuctPipeSizeMismatch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DuctPipeSizeMismatch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DuctPipeSizeMismatch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PipingFailures Class
Autodesk.Revit.DB Namespace